app/views/users/show.html.erb

      <div class="row">
        <% @user.profiles.each do |profile| %>
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1  [["user_id", 2]]