unid/app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(profile_params)
    @profile.user_id = current_user.id
    if @profile.save
---
INSERT INTO "profiles" ("user_id", "uid", "name", "description", "url") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 5], ["uid", "5"], ["name", "s"], ["description", "s"], ["url", "s"]]

  def destroy
    @profile = Profile.find(params[:id])
    @profile.destroy
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "profiles" WHERE "profiles"."id" = $1  [["id", 1]]