app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("user_id", "uid", "name", "description", "url", "image_other") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 20], ["uid", "20"], ["name", "Ben"], ["description", "asfkljlk"], ["url", "asf"], ["image_other", "unid_barcode4.png"]]
---
  def create
    @profile = Profile.new(profile_params('other'))
    @profile.user_id = current_user.id
    @profile.uid = current_user.username
    @profile.provider = 'other'
    if request.xhr?
      if @profile.save

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
UPDATE "profiles" SET "description" = $1, "url" = $2 WHERE "profiles"."id" = $3  [["description", ""], ["url", "twitter"], ["id", 20]]
---
  def update
    @profile = Profile.find(params[:id])
    unless current_user && current_user == @profile.user
      redirect_to user_page(@profile.user)
    else
      if request.xhr?
        if @profile.update(profile_params(@profile.provider))

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
DELETE FROM "profiles" WHERE "profiles"."id" = $1  [["id", 19]]
---
  def destroy
    profile = Profile.find(params[:id])
    unless current_user && current_user == profile.user
      redirect_to user_page(@profile.user)
    else
      profile.destroy