app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ben@unid.com"], ["LIMIT", 1]]
UPDATE "users" SET "temp_password" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["temp_password", "2x1uudgmnboj"], ["password_digest", "$2a$10$8Oe/2/QOxOaeVqDq0hQMzuJCbUD4XLyHsShSbGxrP8NFF3wC75uLS"], ["updated_at", "2017-05-16 17:54:22.881289"], ["id", 2]]
---
  def reset_password
    user = User.find_by(email: params[:email])
    if current_user
      if current_user == user
        user.temp_password = SecureRandom.random_number(36**12).to_s(36).rjust(12, "0")
        if user.save