app/controllers/users_controller.rb

INSERT INTO "users" ("username", "name", "email", "password_digest", "created_at", "updated_at", "temp_password") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    @homepage = true
    @user.temp_password = SecureRandom.random_number(36**12).to_s(36).rjust(12, "0")
    @user.password = @user.temp_password
    @user.password_confirmation = @user.temp_password
    if request.xhr?
      if @user.save

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "ben"], ["LIMIT", 1]]
---
  def change_password
    @user = User.find_by(username: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "ben"], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$Az0.G4JeTgjHmqZqN3P72uKP5xmh.Cvi4eKjdFCSNHFc3lrM8rU1."], ["updated_at", "2017-05-16 18:00:14.724571"], ["id", 2]]
---
  def update_password
    @user = User.find_by(username: params[:id])
    if @user && @user.temp_password && @user.temp_password == params[:password]
      if @user.update(change_password_params)

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "ben"], ["LIMIT", 1]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1  [["user_id", 2]]
---
  def show
    @user = User.find_by(username: params[:id])
    unless @user
      @user = User.new(username: params[:id])
      render :error404
    end
    @profiles = @user.profiles.ordered_by_position_asc

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "ben"], ["LIMIT", 1]]
---
  def edit
    @user = User.find_by(username: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "2"], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "avatar" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "ben2"], ["avatar", "qd3.png"], ["updated_at", "2017-05-16 18:19:56.972020"], ["id", 2]]
---
  def update
    @user = User.find_by(username: params[:id])
    old_email = @user.email
    if request.xhr?
      if @user.update(user_params)