unid/app/views/users/show.html.erb

<ul>
  <% @user.profiles.each do |profile| %>
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1  [["user_id", 5]]